OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/system/README
- fvSolution is used for outer correctors specification.
- fvSchemes is only so that pre-processing activities can proceed
